
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	ПересчитатьИтоговыеЗначенияДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	ПересчитатьИтоговыеЗначенияДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные.Количество = 0 Тогда
		Возврат;
	КонецЕсли;	
	Элементы.Товары.ТекущиеДанные.Цена = Элементы.Товары.ТекущиеДанные.Сумма / Элементы.Товары.ТекущиеДанные.Количество;
	ПересчитатьИтоговыеЗначенияДокумента();
КонецПроцедуры

&НаСервере
Процедура КопироватьВБуферОбменаНаСервере()
	БуферОбмена.КопироватьВБуферОбмена(Объект.Товары);
КонецПроцедуры

&НаКлиенте
Процедура КопироватьВБуферОбмена(Команда)
	КопироватьВБуферОбменаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВставитьИзБуфераОбменаНаСервере()
	СтруктураИзХранилища = БуферОбмена.ВернутьИзБуфераОбмена();	
	ТаблицаИзБуфера = СтруктураИзХранилища.Данные;
	Если Не ТаблицаИзБуфера = Неопределено Тогда
		БуферОбмена.ДополнитьТаблицу(ТаблицаИзБуфера,Объект.Товары);
	Иначе
		Сообщить ("В буфере обмена ничего нет");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфераОбмена(Команда)
	ВставитьИзБуфераОбменаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьИтоговыеЗначенияДокумента()
	
	КоличествоСтрок = Объект.Товары.Количество();
	КоличествоТоваров = Объект.Товары.Итог("Количество");
	ОбщаяСтоимость = Объект.Товары.Итог("Сумма");
	
	Объект.КоличествоСтрок = КоличествоСтрок; 
	Объект.КоличествоТоваров = КоличествоТоваров; 
	Объект.ОбщаяСтоимость = ОбщаяСтоимость; 
	СредняяЦенаТовара = 0;
	
	Если КоличествоТоваров <> 0 Тогда
		СредняяЦенаТовара = ОбщаяСтоимость/КоличествоТоваров; 
	КонецЕсли; 
	
	Объект.СредняяЦенаТовара = СредняяЦенаТовара; 
 
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПересчитатьИтоговыеЗначенияДокумента();
	
КонецПроцедуры
