
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	РассчитатьИтогиДляВыделенных();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогиДляВыделенных()
	
	МассивВыделенных = Элементы.Список.ВыделенныеСтроки;
	СуммаВыделенных = 0;
	КоличествоВыделенных = 0;
	СредняяЦенаВыделенных = 0;
	
	Для Каждого СтрокаМассива Из МассивВыделенных Цикл
		СуммаВыделенных = СуммаВыделенных + Элементы.Список.ДанныеСтроки(СтрокаМассива).ОбщаяСтоимость;        
		КоличествоВыделенных = КоличествоВыделенных + Элементы.Список.ДанныеСтроки(СтрокаМассива).КоличествоТоваров;
	КонецЦикла;
	
	ИтогОбщаяСтоимостьВыделенных = СуммаВыделенных;
	
	Если КоличествоВыделенных <> 0 Тогда
		СредняяЦенаВыделенных = ИтогОбщаяСтоимостьВыделенных/КоличествоВыделенных;
	КонецЕсли;
	
	ИтогСредняяЦенаВыделенных = СредняяЦенаВыделенных;
	
КонецПроцедуры

